In [1]:
from selenium import webdriver
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
path = r"C:\Users\verma\Desktop\Selenium\chromedriver.exe"

In [3]:
driver=webdriver.Chrome(path)

In [4]:
driver.get('https://www.monsterindia.com/srp/results?query=Data%20Scientist&locations=New%20Delhi&searchId=b0d3e642-3fa0-4af3-bc56-8e8a9b3f0f45')

In [5]:
content=driver.page_source
soup=BeautifulSoup(content)
position=soup.findAll('h3',attrs={'class':'medium'})
print(len(position))

company=soup.findAll('span',attrs={'class':'company-name'})
print(len(company))

12
12

In [6]:
Position=[]
Company=[]

In [7]:
for i in position:
    Position.append(i.text)
Position

['Data Analyst / Fresher /  Data Scientist / Graduate Fresher  - MNC - 7303778896 | 9560245147 ',
 'Data Analyst / Fresher /  Data Scientist / Graduate Fresher  - MNC - 7303778896 | 9560245147 ',
 'Data Analyst – Fresher – Data Scientist – Any Graduate - Fresher  6397800351 | 9717266846 ',
 'Data Analyst / Fresher /  Data Scientist / Graduate Fresher  - MNC - 7303778896 | 9560245147 ',
 'Data Analyst – Fresher – Data Scientist – Graduate - Fresher  7303778896 | 9560245147 | 6397800351  ',
 'Data Analyst – Fresher – Data Scientist – Graduate - Fresher  7303778896 | 9560245147 | 6397800351  ',
 'DATA ANALYST – FRESHER – DATA SCIENTIST – SAS – PYTHON – TABLEAU - Fresher / Exp ',
 'Data Scientist - 11 ',
 'Data Scientist - 09 ',
 'Data Scientist - 09 ',
 'Data Scientist - 11 ',
 'Data Scientist - Gurgaon || Experience 5 - 7 years ']

In [46]:
df1=pd.DataFrame(Position)
df1=df1.rename({0:'Job Title'},axis=1)
df1

                                            Job Title
0   Data Analyst / Fresher /  Data Scientist / Gra...
1   Data Analyst / Fresher /  Data Scientist / Gra...
2   Data Analyst – Fresher – Data Scientist – Any ...
3   Data Analyst / Fresher /  Data Scientist / Gra...
4   Data Analyst – Fresher – Data Scientist – Grad...
5   Data Analyst – Fresher – Data Scientist – Grad...
6   DATA ANALYST – FRESHER – DATA SCIENTIST – SAS ...
7                                Data Scientist - 11
8                                Data Scientist - 09
9                                Data Scientist - 09
10                               Data Scientist - 11
11  Data Scientist - Gurgaon || Experience 5 - 7 y...

In [8]:
for i in company:
    Company.append(i.text)
Company

['Structured Learning Assistance Consultants India Private Limited',
 'Structured Learning Assistance Consultants India Private Limited',
 'Structured Learning Assistance Consultants India Private Limited',
 'Structured Learning Assistance Consultants India Private Limited',
 'Structured Learning Assistance Consultants India Private Limited',
 'Structured Learning Assistance Consultants India Private Limited',
 'Structured Learning Assistance Consultants India Private Limited',
 'Accenture',
 'Accenture',
 'Accenture',
 'Accenture',
 'WNS Global Services Private Limited']

In [45]:
df2=pd.DataFrame(Company)
df2=df2.rename({0:'Company Name'},axis=1)
df2

                                         Company Name
0   Structured Learning Assistance Consultants Ind...
1   Structured Learning Assistance Consultants Ind...
2   Structured Learning Assistance Consultants Ind...
3   Structured Learning Assistance Consultants Ind...
4   Structured Learning Assistance Consultants Ind...
5   Structured Learning Assistance Consultants Ind...
6   Structured Learning Assistance Consultants Ind...
7                                           Accenture
8                                           Accenture
9                                           Accenture
10                                          Accenture
11                WNS Global Services Private Limited

In [34]:
z=driver.find_elements_by_xpath("//div[@class='col-xxs-12 col-sm-5 text-ellipsis']/span/small")

In [35]:
z

[<selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="e97b742f-f561-4e20-9e7d-bf08e0f86f29")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="44062e52-d822-4dfa-b02a-f9ba66dea5a8")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="b89763ed-2c77-4e1d-b54b-490fb4bd11e0")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="264b185a-69e8-404d-b403-130f9c728b66")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="c6585612-ee58-437a-97ca-42a0ef3bdbfb")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="46faf562-95c7-45d5-b1e4-4b95bbc70dbb")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="f2699035-25cd-465b-95ce-401614dc799e")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="13a58f50-3962-418f-9414-39aab257ad00")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="3bcdf162-f5cb-4582-ad49-c0441e39a8d5")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="36d6c512-b430-4f4e-9575-bcab1148d32d")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="52976eed-f919-4ad9-8907-ff2ac5eb667e")>,
 <selenium.webdriver.remote.webelement.WebElement (session="ba206aacb439525a7f5bf182e5a1b3e3", element="026c88b6-6bca-4acf-8a55-518e9b959545")>]

In [36]:
Location=[]

In [37]:
for i in z:
    kR= i.text
    Location.append(kR)
Location

['Delhi, Ghaziabad',
 'Delhi, Gurgaon / Gurugram',
 'Delhi, Noida',
 'Delhi, Ghaziabad',
 'Delhi, Noida',
 'Delhi, Gurgaon / Gurugram',
 'Delhi, Noida',
 'Delhi, Mumbai',
 'Delhi, Mumbai',
 'Delhi, Mumbai',
 'Delhi, Mumbai',
 'Delhi, Delhi NCR']

In [49]:
df3=pd.DataFrame(Location)
df3=df3.rename({0:'Location'},axis=1)
df3

                     Location
0            Delhi, Ghaziabad
1   Delhi, Gurgaon / Gurugram
2                Delhi, Noida
3            Delhi, Ghaziabad
4                Delhi, Noida
5   Delhi, Gurgaon / Gurugram
6                Delhi, Noida
7               Delhi, Mumbai
8               Delhi, Mumbai
9               Delhi, Mumbai
10              Delhi, Mumbai
11           Delhi, Delhi NCR

In [50]:
Data_Scientist=pd.concat([df1,df2,df3],axis=1)
Data_Scientist

,Job Title,Company Name,Location
0,Data Analyst / Fresher / Data Scientist / Gra...,Structured Learning Assistance Consultants Ind...,"Delhi, Ghaziabad"
1,Data Analyst / Fresher / Data Scientist / Gra...,Structured Learning Assistance Consultants Ind...,"Delhi, Gurgaon / Gurugram"
2,Data Analyst – Fresher – Data Scientist – Any ...,Structured Learning Assistance Consultants Ind...,"Delhi, Noida"
3,Data Analyst / Fresher / Data Scientist / Gra...,Structured Learning Assistance Consultants Ind...,"Delhi, Ghaziabad"
4,Data Analyst – Fresher – Data Scientist – Grad...,Structured Learning Assistance Consultants Ind...,"Delhi, Noida"
5,Data Analyst – Fresher – Data Scientist – Grad...,Structured Learning Assistance Consultants Ind...,"Delhi, Gurgaon / Gurugram"
6,DATA ANALYST – FRESHER – DATA SCIENTIST – SAS ...,Structured Learning Assistance Consultants Ind...,"Delhi, Noida"
7,Data Scientist - 11,Accenture,"Delhi, Mumbai"
8,Data Scientist - 09,Accenture,"Delhi, Mumbai"
9,Data Scientist - 09,Accenture,"Delhi, Mumbai"
10,Data Scientist - 11,Accenture,"Delhi, Mumbai"
11,Data Scientist - Gurgaon || Experience 5 - 7 y...,WNS Global Services Private Limited,"Delhi, Delhi NCR"

# Saving Data in CSV file

In [51]:
Data_Scientist.to_csv("Data_Scientist_jobs.csv")